# Tipos de variables que componen un data frame

In [1]:
import pandas as pd

In [2]:
pd.__version__

'1.0.1'

In [2]:
df_meteorites = pd.read_csv('../../datasets/nasa/Meteorite_Landings.csv')

In [3]:
# Ver los primeros registros del data frame
df_meteorites.head()

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,01/01/1880 12:00:00 AM,50.77500,6.08333,"(50.775, 6.08333)"
1,Aarhus,2,Valid,H6,720.0,Fell,01/01/1951 12:00:00 AM,56.18333,10.23333,"(56.18333, 10.23333)"
2,Abee,6,Valid,EH4,107000.0,Fell,01/01/1952 12:00:00 AM,54.21667,-113.00000,"(54.21667, -113.0)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,01/01/1976 12:00:00 AM,16.88333,-99.90000,"(16.88333, -99.9)"
4,Achiras,370,Valid,L6,780.0,Fell,01/01/1902 12:00:00 AM,-33.16667,-64.95000,"(-33.16667, -64.95)"

In [7]:
# Ver los ultimos registros del data frame
df_meteorites.tail()

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
45711,Zillah 002,31356,Valid,Eucrite,172.0,Found,01/01/1990 12:00:00 AM,29.03700,17.01850,"(29.037, 17.0185)"
45712,Zinder,30409,Valid,"Pallasite, ungrouped",46.0,Found,01/01/1999 12:00:00 AM,13.78333,8.96667,"(13.78333, 8.96667)"
45713,Zlin,30410,Valid,H4,3.3,Found,01/01/1939 12:00:00 AM,49.25000,17.66667,"(49.25, 17.66667)"
45714,Zubkovsky,31357,Valid,L6,2167.0,Found,01/01/2003 12:00:00 AM,49.78917,41.50460,"(49.78917, 41.5046)"
45715,Zulu Queen,30414,Valid,L3.7,200.0,Found,01/01/1976 12:00:00 AM,33.98333,-115.68333,"(33.98333, -115.68333)"

In [10]:
# Ver una muestra aleatoria de registros del data frame
df_meteorites.sample(5)

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
30089,Northwest Africa 6737,54602,Valid,H~5,324.00,Found,01/01/2010 12:00:00 AM,0.00000,0.00000,"(0.0, 0.0)"
41801,Yamato 793140,28489,Valid,E3,0.59,Found,01/01/1979 12:00:00 AM,-71.50000,35.66667,"(-71.5, 35.66667)"
34053,Queen Alexandra Range 97422,20878,Valid,LL5,10.60,Found,01/01/1997 12:00:00 AM,-84.00000,168.00000,"(-84.0, 168.0)"
34402,Queen Alexandra Range 97769,21224,Valid,L6,7.10,Found,01/01/1997 12:00:00 AM,-84.00000,168.00000,"(-84.0, 168.0)"
9807,Elephant Moraine 87656,8206,Valid,L6,35.30,Found,01/01/1987 12:00:00 AM,-76.28293,156.44685,"(-76.28293, 156.44685)"

In [16]:
# Ver el tamano del data frame
df_meteorites.shape

(45716, 10)

In [15]:
# La cantidad de datos que componen el data frame
df_meteorites.size

457160

In [20]:
# Especificar el numero de decimales que se desean de un data frame
pd.options.display.float_format = '{:.1f}'.format

In [21]:
# Cualidades estadisticas de las variables numericas de la base de datos
df_meteorites.describe()

           id   mass (g)  reclat  reclong
count 45716.0    45585.0 38401.0  38401.0
mean  26889.7    13278.1   -39.1     61.1
std   16860.7   574988.9    46.4     80.6
min       1.0        0.0   -87.4   -165.4
25%   12688.8        7.2   -76.7      0.0
50%   24261.5       32.6   -71.5     35.7
75%   40656.8      202.6     0.0    157.2
max   57458.0 60000000.0    81.2    354.5

In [23]:
# Obtener informacion de variables tipo texto
df_meteorites.describe(include = 'all')

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
count,45716,45716.0,45716,45716,45585.0,45716,45425,38401.0,38401.0,38401
unique,45716,nan,2,466,nan,2,266,nan,nan,17100
top,Elephant Moraine 90518,nan,Valid,L6,nan,Found,01/01/2003 12:00:00 AM,nan,nan,"(0.0, 0.0)"
freq,1,nan,45641,8285,nan,44609,3323,nan,nan,6214
mean,NaN,26889.7,NaN,NaN,13278.1,NaN,NaN,-39.1,61.1,NaN
std,NaN,16860.7,NaN,NaN,574988.9,NaN,NaN,46.4,80.6,NaN
min,NaN,1.0,NaN,NaN,0.0,NaN,NaN,-87.4,-165.4,NaN
25%,NaN,12688.8,NaN,NaN,7.2,NaN,NaN,-76.7,0.0,NaN
50%,NaN,24261.5,NaN,NaN,32.6,NaN,NaN,-71.5,35.7,NaN
75%,NaN,40656.8,NaN,NaN,202.6,NaN,NaN,0.0,157.2,NaN
max,NaN,57458.0,NaN,NaN,60000000.0,NaN,NaN,81.2,354.5,NaN

In [26]:
# Ver la informacion de la estructura de las variables
df_meteorites.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45716 entries, 0 to 45715
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         45716 non-null  object
 1   id           45716 non-null  int64
 2   nametype     45716 non-null  object
 3   recclass     45716 non-null  object
 4   mass (g)     45585 non-null  float64
 5   fall         45716 non-null  object
 6   year         45425 non-null  object
 7   reclat       38401 non-null  float64
 8   reclong      38401 non-null  float64
 9   GeoLocation  38401 non-null  object
dtypes: float64(3), int64(1), object(6)
memory usage: 3.5+ MB

In [25]:
# Ver el tipo de datos de las variables del data frame
df_meteorites.dtypes

name            object
id               int64
nametype        object
recclass        object
mass (g)       float64
fall            object
year            object
reclat         float64
reclong        float64
GeoLocation     object
dtype: object

In [45]:
# Cambiar los tipos de datos del data frame a un tipo de dato mas adecuado
df_meteorites.convert_dtypes().dtypes

name            string
id               Int64
nametype        string
recclass        string
mass (g)       float64
fall            string
year            string
reclat         float64
reclong        float64
GeoLocation     string
dtype: object

In [39]:
# Ver la variedad de valores de las columnas
df_meteorites.nunique()

name           45716
id             45716
nametype           2
recclass         466
mass (g)       12576
fall               2
year             266
reclat         12738
reclong        14640
GeoLocation    17100
dtype: int64

In [48]:
df_meteorites[['nametype', 'fall']]

      nametype   fall
0        Valid   Fell
1        Valid   Fell
2        Valid   Fell
3        Valid   Fell
4        Valid   Fell
...        ...    ...
45711    Valid  Found
45712    Valid  Found
45713    Valid  Found
45714    Valid  Found
45715    Valid  Found

[45716 rows x 2 columns]

In [51]:
# Convertir a variables categoricas
df_meteorites[['nametype', 'fall']] = df_meteorites[['nametype', 'fall']].astype('category')

In [52]:
df_meteorites.dtypes

name             object
id                int64
nametype       category
recclass         object
mass (g)        float64
fall           category
year             object
reclat          float64
reclong         float64
GeoLocation      object
dtype: object

In [53]:
# Ver los valores que componen una variable
df_meteorites['fall'].unique()

[Fell, Found]
Categories (2, object): [Fell, Found]

In [64]:
# Ver la frecuencia que aparecen los valores en una variable
df_meteorites['fall'].value_counts()

Found    44609
Fell      1107
Name: fall, dtype: int64

In [76]:
pd.get_dummies(df_meteorites['fall'], prefix = 'fall')

       fall_Fell  fall_Found
0              1           0
1              1           0
2              1           0
3              1           0
4              1           0
...          ...         ...
45711          0           1
45712          0           1
45713          0           1
45714          0           1
45715          0           1

[45716 rows x 2 columns]

In [4]:
# Crear una nueva columna con valores 1
df_meteorites['ones'] = 1
df_meteorites.head()

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation,ones
0,Aachen,1,Valid,L5,21.0,Fell,01/01/1880 12:00:00 AM,50.77500,6.08333,"(50.775, 6.08333)",1
1,Aarhus,2,Valid,H6,720.0,Fell,01/01/1951 12:00:00 AM,56.18333,10.23333,"(56.18333, 10.23333)",1
2,Abee,6,Valid,EH4,107000.0,Fell,01/01/1952 12:00:00 AM,54.21667,-113.00000,"(54.21667, -113.0)",1
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,01/01/1976 12:00:00 AM,16.88333,-99.90000,"(16.88333, -99.9)",1
4,Achiras,370,Valid,L6,780.0,Fell,01/01/1902 12:00:00 AM,-33.16667,-64.95000,"(-33.16667, -64.95)",1

In [78]:
# Agregando las variables dummies al data frame
df_meteorites[['fell', 'found']] = pd.get_dummies(df_meteorites['fall'])

In [79]:
df_meteorites.head()

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation,ones,fell,found
0,Aachen,1,Valid,L5,21.0,Fell,01/01/1880 12:00:00 AM,50.8,6.1,"(50.775, 6.08333)",1,1,0
1,Aarhus,2,Valid,H6,720.0,Fell,01/01/1951 12:00:00 AM,56.2,10.2,"(56.18333, 10.23333)",1,1,0
2,Abee,6,Valid,EH4,107000.0,Fell,01/01/1952 12:00:00 AM,54.2,-113.0,"(54.21667, -113.0)",1,1,0
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,01/01/1976 12:00:00 AM,16.9,-99.9,"(16.88333, -99.9)",1,1,0
4,Achiras,370,Valid,L6,780.0,Fell,01/01/1902 12:00:00 AM,-33.2,-65.0,"(-33.16667, -64.95)",1,1,0

In [80]:
df_meteorites['year']

0        01/01/1880 12:00:00 AM
1        01/01/1951 12:00:00 AM
2        01/01/1952 12:00:00 AM
3        01/01/1976 12:00:00 AM
4        01/01/1902 12:00:00 AM
                  ...
45711    01/01/1990 12:00:00 AM
45712    01/01/1999 12:00:00 AM
45713    01/01/1939 12:00:00 AM
45714    01/01/2003 12:00:00 AM
45715    01/01/1976 12:00:00 AM
Name: year, Length: 45716, dtype: object

In [82]:
# Transformar a una variable tipo tiempo
pd.to_datetime(
    df_meteorites['year'],
    errors = 'coerce',
    format = '%m/%d/%Y %H:%M:%S %p'
)

0       1880-01-01 12:00:00
1       1951-01-01 12:00:00
2       1952-01-01 12:00:00
3       1976-01-01 12:00:00
4       1902-01-01 12:00:00
                ...
45711   1990-01-01 12:00:00
45712   1999-01-01 12:00:00
45713   1939-01-01 12:00:00
45714   2003-01-01 12:00:00
45715   1976-01-01 12:00:00
Name: year, Length: 45716, dtype: datetime64[ns]

In [83]:
df_meteorites['year'] = pd.to_datetime(
    df_meteorites['year'],
    errors = 'coerce',
    format = '%m/%d/%Y %H:%M:%S %p'
)

In [99]:
df_meteorites = df_meteorites.convert_dtypes()
df_meteorites.dtypes

name                   string
id                      Int64
nametype             category
recclass               string
mass                  float64
fall                 category
year           datetime64[ns]
reclat                float64
reclong               float64
GeoLocation            string
ones                    Int64
fell                    UInt8
found                   UInt8
dtype: object

In [89]:
# Renombrar columnas
df_meteorites.rename(columns = {'mass (g)': 'mass'}, inplace=True)
df_meteorites.columns

Index(['name', 'id', 'nametype', 'recclass', 'mass', 'fall', 'year', 'reclat',
       'reclong', 'GeoLocation', 'ones', 'fell', 'found'],
      dtype='object')

In [9]:
# Borrar una columna de un data frame
df_meteorites.drop(['ones'], axis = 1, inplace = True)
df_meteorites.head()

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,01/01/1880 12:00:00 AM,50.77500,6.08333,"(50.775, 6.08333)"
1,Aarhus,2,Valid,H6,720.0,Fell,01/01/1951 12:00:00 AM,56.18333,10.23333,"(56.18333, 10.23333)"
2,Abee,6,Valid,EH4,107000.0,Fell,01/01/1952 12:00:00 AM,54.21667,-113.00000,"(54.21667, -113.0)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,01/01/1976 12:00:00 AM,16.88333,-99.90000,"(16.88333, -99.9)"
4,Achiras,370,Valid,L6,780.0,Fell,01/01/1902 12:00:00 AM,-33.16667,-64.95000,"(-33.16667, -64.95)"

In [12]:
# Borrar una o mas filas del data frame
df_meteorites.drop(index = [1, 2, 3, 4], inplace=True)
df_meteorites.head()

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,01/01/1880 12:00:00 AM,50.77500,6.08333,"(50.775, 6.08333)"
5,Adhi Kot,379,Valid,EH4,4239.0,Fell,01/01/1919 12:00:00 AM,32.10000,71.80000,"(32.1, 71.8)"
6,Adzhi-Bogdo (stone),390,Valid,LL3-6,910.0,Fell,01/01/1949 12:00:00 AM,44.83333,95.16667,"(44.83333, 95.16667)"
7,Agen,392,Valid,H5,30000.0,Fell,01/01/1814 12:00:00 AM,44.21667,0.61667,"(44.21667, 0.61667)"
8,Aguada,398,Valid,L6,1620.0,Fell,01/01/1930 12:00:00 AM,-31.60000,-65.23333,"(-31.6, -65.23333)"

In [13]:
df_meteorites.drop(columns = ['name', 'id', 'nametype'], inplace=True)
df_meteorites.head()

,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
0,L5,21.0,Fell,01/01/1880 12:00:00 AM,50.77500,6.08333,"(50.775, 6.08333)"
5,EH4,4239.0,Fell,01/01/1919 12:00:00 AM,32.10000,71.80000,"(32.1, 71.8)"
6,LL3-6,910.0,Fell,01/01/1949 12:00:00 AM,44.83333,95.16667,"(44.83333, 95.16667)"
7,H5,30000.0,Fell,01/01/1814 12:00:00 AM,44.21667,0.61667,"(44.21667, 0.61667)"
8,L6,1620.0,Fell,01/01/1930 12:00:00 AM,-31.60000,-65.23333,"(-31.6, -65.23333)"

In [15]:
# Generar una copia del data frame
df = df_meteorites.copy(deep = True)
df.head()

,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
0,L5,21.0,Fell,01/01/1880 12:00:00 AM,50.77500,6.08333,"(50.775, 6.08333)"
5,EH4,4239.0,Fell,01/01/1919 12:00:00 AM,32.10000,71.80000,"(32.1, 71.8)"
6,LL3-6,910.0,Fell,01/01/1949 12:00:00 AM,44.83333,95.16667,"(44.83333, 95.16667)"
7,H5,30000.0,Fell,01/01/1814 12:00:00 AM,44.21667,0.61667,"(44.21667, 0.61667)"
8,L6,1620.0,Fell,01/01/1930 12:00:00 AM,-31.60000,-65.23333,"(-31.6, -65.23333)"